In [1]:
import pandas as pd

In [2]:
people = {
    "first": ["Bob", 'Jane', 'John', 'Vadim', 'Jackie', 'Bruce'], 
    "last": ["Schafer", 'Doe', 'Doe', 'Smart', 'Chan', 'Lee'], 
    "email": ["Bob@email.com", 'Jane@email.com', 'John@email.com', 'Vadim@email.com', 'Jackie@email.net', 'Bruce@email.net']
}

In [3]:
df = pd.DataFrame(people)
df

    first     last             email
0     Bob  Schafer     Bob@email.com
1    Jane      Doe    Jane@email.com
2    John      Doe    John@email.com
3   Vadim    Smart   Vadim@email.com
4  Jackie     Chan  Jackie@email.net
5   Bruce      Lee   Bruce@email.net

In [4]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [5]:
df.columns = ['first_name', 'last_name', 'email']

In [7]:
df.columns

Index(['first_name', 'last_name', 'email'], dtype='object')

In [8]:
df

  first_name last_name             email
0        Bob   Schafer     Bob@email.com
1       Jane       Doe    Jane@email.com
2       John       Doe    John@email.com
3      Vadim     Smart   Vadim@email.com
4     Jackie      Chan  Jackie@email.net
5      Bruce       Lee   Bruce@email.net

In [9]:
df.columns = [x.upper() for x in df.columns]
df

  FIRST_NAME LAST_NAME             EMAIL
0        Bob   Schafer     Bob@email.com
1       Jane       Doe    Jane@email.com
2       John       Doe    John@email.com
3      Vadim     Smart   Vadim@email.com
4     Jackie      Chan  Jackie@email.net
5      Bruce       Lee   Bruce@email.net

In [11]:
df.columns = [x.lower() for x in df.columns]
df

  first_name last_name             email
0        Bob   Schafer     Bob@email.com
1       Jane       Doe    Jane@email.com
2       John       Doe    John@email.com
3      Vadim     Smart   Vadim@email.com
4     Jackie      Chan  Jackie@email.net
5      Bruce       Lee   Bruce@email.net

In [12]:
df.rename(columns={'first_name': 'first', 'last_name': 'last'}, inplace=True)

In [13]:
df.loc[3]

first              Vadim
last               Smart
email    Vadim@email.com
Name: 3, dtype: object

In [14]:
df.loc[2] = ['John', 'Smith', 'JohnSmith@email.com']
df

    first     last                email
0     Bob  Schafer        Bob@email.com
1    Jane      Doe       Jane@email.com
2    John    Smith  JohnSmith@email.com
3   Vadim    Smart      Vadim@email.com
4  Jackie     Chan     Jackie@email.net
5   Bruce      Lee      Bruce@email.net

In [18]:
df.loc[2, ['last', 'email']] = ['Doe', 'JohnDoe@email.com']
df.loc[2, 'email'] = 'John@email.com'
df

    first     last             email
0     Bob  Schafer     Bob@email.com
1    Jane      Doe    Jane@email.com
2    John      Doe    John@email.com
3   Vadim    Smart   Vadim@email.com
4  Jackie     Chan  Jackie@email.net
5   Bruce      Lee   Bruce@email.net

In [19]:
my_filter = (df['email'] == 'John@email.com')
df[my_filter]

  first last           email
2  John  Doe  John@email.com

In [20]:
df[my_filter]['last']

2    Doe
Name: last, dtype: object

In [21]:
df['email'].str.lower()

0       bob@email.com
1      jane@email.com
2      john@email.com
3     vadim@email.com
4    jackie@email.net
5     bruce@email.net
Name: email, dtype: object

In [23]:
df['email'] =  df['email'].str.lower()
df

    first     last             email
0     Bob  Schafer     bob@email.com
1    Jane      Doe    jane@email.com
2    John      Doe    john@email.com
3   Vadim    Smart   vadim@email.com
4  Jackie     Chan  jackie@email.net
5   Bruce      Lee   bruce@email.net

### apply  applymap  map  replace

In [24]:
df['email'].apply(len)

0    13
1    14
2    14
3    15
4    16
5    15
Name: email, dtype: int64

In [25]:
def update_email(email):
    return email.upper()

In [26]:
df['email'].apply(update_email)

0       BOB@EMAIL.COM
1      JANE@EMAIL.COM
2      JOHN@EMAIL.COM
3     VADIM@EMAIL.COM
4    JACKIE@EMAIL.NET
5     BRUCE@EMAIL.NET
Name: email, dtype: object

In [27]:
df.apply(len)

first    6
last     6
email    6
dtype: int64

In [28]:
df.apply(len, axis=1)

0    3
1    3
2    3
3    3
4    3
5    3
dtype: int64

In [29]:
df.apply(pd.Series.min)

first              Bob
last              Chan
email    bob@email.com
dtype: object

In [30]:
df.applymap(len)

C:\Users\User\AppData\Local\Temp\ipykernel_7320\1485728669.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(len)

   first  last  email
0      3     7     13
1      4     3     14
2      4     3     14
3      5     5     15
4      6     4     16
5      5     3     15

In [31]:
df.map(len)

   first  last  email
0      3     7     13
1      4     3     14
2      4     3     14
3      5     5     15
4      6     4     16
5      5     3     15

In [32]:
df.map(str.lower)

    first     last             email
0     bob  schafer     bob@email.com
1    jane      doe    jane@email.com
2    john      doe    john@email.com
3   vadim    smart   vadim@email.com
4  jackie     chan  jackie@email.net
5   bruce      lee   bruce@email.net